Repository: osexpert/vs-streamjsonrpc
Catalog: src/StreamJsonRpc/MultilingualResources/StreamJsonRpc.*.xlf
Languages: cs, de, ko, ru, tr

# BothReadableWritableAreNull
source: Both readable and writable are null.
cs: Parametr readable i writable jsou null.
de: "readable" und "writable" sind NULL.
ko: 읽고 쓸 수 있는 개체는 null입니다.
ru: И элементы, которые можно считать, и элементы, которые доступны для записи, имеют значение NULL.
tr: Readable ve writable null.

# DroppingRequestDueToNoTargetObject
source: Got a request to execute '{0}' but have no callback object. Dropping the request.
cs: Byla přijata žádost o provedení {0}, ale chybí objekt zpětného volání. Žádost se ruší.
de: Eine Anforderung zum Ausführen von "{0}" wurde ausgegeben, es ist aber kein Rückrufobjekt vorhanden. Die Anforderung wird gelöscht.
ko: ‘{0}’을(를) 실행하도록 요청을 받았지만 이 요청에 콜백 개체가 없습니다. 요청을 삭제합니다.
ru: Получен запрос на выполнение "{0}", но отсутствует объект обратного вызова. Удаление запроса.
tr: '{0}' metodunu yürütme isteği alındı ancak geri çağırma nesnesi yok. İstek bırakılıyor.

# ErrorWritingJsonRpcResult
source: Error writing JSON RPC Result: {0}: {1}
cs: Chyba při zápisu výsledku JSON RPC: {0}: {1}
de: Fehler beim Schreiben des JSON-RPC-Ergebnisses: {0}: {1}
ko: JSON RPC 결과를 쓰는 동안 오류 발생: {0}:{1}
ru: Произошла ошибка при записи результата RPC JSON. {0}: {1}
tr: JSON RPC Sonucu yazılırken bir hata oluştu: {0}: {1}

# FailureDeserializingJsonRpc
source: Failure deserializing incoming JSON RPC '{0}': {1}
cs: Selhání při deserializaci příchozího JSON RPC: {0}: {1}
de: Fehler beim Deserialisieren des eingehenden JSON-RPC "{0}": {1}
ko: 들어오는 JSON RPC '{0}'을(를) 역직렬화하는 데 실패:{1}
ru: Ошибка при десериализации входящих данных RPC JSON "{0}": {1}
tr: Gelen JSON RPC '{0}' seri durumdan çıkarılamadı: {1}

# JsonRpcCannotBeNull
source: JSON RPC must not be null.
cs: JSON RPC nesmí být null.
de: Der JSON-RPC darf nicht NULL sein.
ko: JSON RPC는 null이면 안 됩니다.
ru: RPC JSON не должен равняться NULL.
tr: JSON RPC null olmamalıdır.

# MethodHasRefOrOutParameters
source: {0} has ref or out parameter(s), which is not supported
cs: {0} má parametry ref nebo out, což se nepodporuje.
de: "{0}" weist ref- oder out-Parameter auf. Dies wird nicht unterstützt
ko: {0}에 ref 또는 지원되지 않는 출력 매개 변수가 있습니다.
ru: {0} имеет параметры REF или OUT, что не поддерживается
tr: {0} desteklenmeyen ref veya out parametrelerine sahip

# MethodParameterCountDoesNotMatch
source: {0} parameter(s) (excluding any CancellationToken): {1}, but the request supplies {2}
cs: Parametry {0} (vyjma jakýchkoli objektů CancellationToken): {1}, ale žádost poskytuje {2}.
de: {0}-Parameter (ausschließlich CancellationToken): {1}, die Anforderung stellt aber {2} bereit.
ko: {0} 매개 변수(CancellationToken 제외)는 {1}이지만 요청에서는 {2}이(가) 제공됩니다.
ru: Число параметров в {0} (исключая любые CancellationToken): {1}; в запросе же указано {2}.
tr: {0} metodunun {1} parametresi var (İptal Belirteci’ni dışta tutarak), ancak istekte {2} parametre belirtildi

# MethodParametersNotCompatible
source: {0} parameters are not compatible with the arguments provided in the request.
cs: Počet parametrů nekompatibilních s argumenty zadanými v žádosti: {0}
de: {0}-Parameter sind nicht kompatibel mit den in der Anforderung angegebenen Argumenten.
ko: {0} 매개 변수가 {1} 요청과 호환되지 않습니다.
ru: Параметры {0} несовместимы с аргументами, переданными в запросе.
tr: {0} parametreleri istekte sağlanan bağımsız değişkenlerle uyumlu değil.

source: Reached end of stream.
cs: Bylo dosaženo konce streamu.
de: Das Ende des Datenstroms wurde erreicht.
ko: 스트림 끝에 도달했습니다.
ru: Достигнут конец потока.
tr: Akışın sonuna ulaşıldı.

# ReadingJsonRpcStreamFailed
source: Reading JSON RPC from the stream failed with {0}: {1}
cs: Čtení RPC JSON ze streamu se nezdařilo s {0}: {1}
de: Fehler beim Lesen des JSON-RPC aus dem Datenstrom mit {0}: {1}
ko: {0}(으)로 인해 스트림에서 JSON RPC 읽기 실패:{1}
ru: Произошел сбой при чтении RPC JSON из потока. Исключение {0}: {1}
tr: Akıştan JSON RPC okunamadı. Özel durum: {0}: {1}

source: Response is not error.
cs: Odpověď není chyba.
de: Die Antwort ist kein Fehler.
ko: 응답은 오류가 아닙니다.
ru: Отклик не является ошибкой.
tr: Yanıt hata değil.

# StreamDisposed
source: Stream has been disposed
cs: Stream byl vyřazen.
de: Der Datenstrom wurde verworfen.
ko: 스트림이 삭제되었습니다.
ru: Поток был удален
tr: Akış atıldı

# TaskNotCompleted
source: The task is not completed.
cs: Úloha není dokončena.
de: Der Task ist nicht abgeschlossen.
ko: 작업이 완료되지 않았습니다.
ru: Задача не завершена.
tr: Görev tamamlanmadı.

# TaskWasCancelled
source: The task was cancelled.
cs: Úloha byla zrušena.
de: Der Task wurde abgebrochen.
ko: 작업이 취소되었습니다.
ru: Задача отменена.
tr: Bu görev iptal edildi.

# UnableToFindMethod
source: Unable to find method '{0}/{1}' on {2} for the following reasons: {3}
cs: Nebyla nalezena metoda {0}/{1} v {2} z následujících důvodů: {3}
de: Die Methode "{0}/{1}" für "{2}" wurde aus den folgenden Gründen nicht gefunden: {3}
ko: {2}에서 '{0}/{1}' 메서드를 다음과 같은 이유로 찾을 수 없음:{3}
ru: Не удалось найти метод "{0}/{1}" в {2} по следующим причинам: {3}
tr: '{0}/{1}' metodu {2} üzerinde şu nedenlerle bulunamadı: {3}

# UnexpectedErrorProcessingJsonRpc
source: Unexpected error processing JSON-RPC message: {0}
cs: Neočekávaná chyba při zpracování zprávy JSON-RPC: {0}
de: Unerwarteter Fehler beim Verarbeiten der JSON-RPC-Nachricht: {0}
ko: JSON RPC '{0}'을(를) 처리하는 동안 예기치 않은 오류 발생:{1}
ru: Непредвиденная ошибка при обработке сообщения JSON-RPC: {0}
tr: JSON-RPC iletisi işlenirken beklenmeyen hata oluştu: {0}

# UnrecognizedIncomingJsonRpc
source: Incoming JSON-RPC message did not conform to a recognized pattern.
cs: Příchozí zpráva JSON-RPC se neshoduje s rozpoznávaným vzorkem.
de: Die eingehende JSON-RPC-Nachricht entsprach keinem bekannten Muster.
ko: 인식되지 않은 들어오는 JSON RPC '{0}'
ru: Входящее сообщение JSON-RPC не соответствует распознанному шаблону.
tr: Gelen JSON-RPC iletisi tanınan bir desene uymuyor.

# HeaderContentLengthNotParseable
source: Failed parsing Content-Length header into a positive integer.
cs: Selhalo zparsování hlavičky Content-Length na kladné celé číslo.
de: Fehler beim Analysieren des Content-Length-Headers in einen positiven Integerwert.
ko: Content-Length 헤더를 양의 정수로 구문 분석할 수 없습니다.
ru: Ошибка при анализе заголовка Content-Length в положительное целое число.
tr: Content-Length üst bilgisini pozitif bir tamsayıya ayrıştırma başarısız oldu.

# HeaderValueTooLarge
source: The size of the message header exceeds the maximum supported size.
cs: Velikost hlavičky zprávy překračuje maximální podporovanou velikost.
de: Die Größe der Nachrichtenheaders überschreitet die maximal unterstützte Größe.
ko: 메시지 헤더의 크기가 지원되는 최대 크기를 초과합니다.
ru: Размер заголовка сообщения превышает предельный.
tr: İleti üst bilgisinin boyutu, desteklenen boyut üst sınırını aşıyor.

# UnexpectedTokenReadingHeader
source: Unexpected token '{0}' while parsing header.
cs: Neočekávaný token {0} při parsování hlavičky
de: Unerwartetes Token "{0}" beim Analysieren des Headers.
ko: 헤더를 구문 분석하는 동안 예기치 않은 토큰 '{0}'이(가) 발생했습니다.
ru: Непредвиденная лексема "{0}" при анализе заголовка.
tr: Üst bilgi ayrıştırılırken beklenmeyen '{0}' belirteci.

# PositiveIntegerRequired
source: A positive integer is required.
cs: Je vyžadováno kladné celé číslo.
de: Ein positiver Integerwert ist erforderlich.
ko: 양의 정수가 필요합니다.
ru: Требуется положительное целое число.
tr: Pozitif bir tamsayı gereklidir.

# FillBufferFirst
source: The buffer is empty. Call the async method to fill it first.
cs: Vyrovnávací paměť je prázdná. Nejdříve ji naplňte, a to zavoláním asynchronní metody.
de: Der Puffer ist leer. Rufen Sie die asynchrone Methode auf, um ihn zuerst mit Daten aufzufüllen.
ko: 버퍼가 비어 있으므로 이를 채우기 위해 비동기 메서드를 호출합니다.
ru: Буфер пуст. Сначала вызовите метод async, чтобы заполнить его.
tr: Arabellek boş. İlk olarak, arabelleği doldurmak için zaman uyumsuz yöntemini çağırın.

# NonNegativeIntegerRequired
source: A non-negative integer is required.
cs: Je vyžadováno nezáporné celé číslo.
de: Ein nicht negativer Integerwert ist erforderlich.
ko: 음수가 아닌 정수가 필요합니다.
ru: Требуется неотрицательное целое число.
tr: Negatif olmayan tamsayı gereklidir.

# SumOfTwoParametersExceedsArrayLength
source: The {0} and {1} parameters exceed length of array.
cs: Parametry {0} a {1} překračují délku pole.
de: Die Parameter {0} und {1} überschreiten die Länge des Arrays.
ko: {0} 및 {1} 매개 변수가 배열 길이를 초과합니다.
ru: Параметры {0} и {1} превышают длину массива.
tr: {0} ve {1} parametreleri dizi uzunluğunu aşıyor.

# StreamMustBeReadable
source: The stream must be readable.
cs: Ze streamu musí být možné číst.
de: Der Datenstrom muss lesbar sein.
ko: 스트림은 읽을 수 있는 상태여야 합니다.
ru: Поток должен быть читаемым.
tr: Akış okunabilir olmalıdır.

# StreamMustBeWriteable
source: The stream must be writeable.
cs: Do streamu musí být možné zapisovat.
de: In den Datenstrom muss geschrieben werden können.
ko: 스트림은 쓸 수 있는 상태여야 합니다.
ru: Поток должен быть доступным для записи.
tr: Akış yazılabilir olmalıdır.

# InvalidAfterListenHasStarted
source: This operation is not allowed after listening for messages has started.
cs: Po zahájení naslouchání zprávám není tato operace povolená.
de: Dieser Vorgang ist unzulässig, nachdem das Lauschen auf Nachrichten gestartet wurde.
ko: 메시지 수신이 시작된 뒤에는 이 작업이 허용되지 않습니다.
ru: Эта операция не разрешена после начала ожидания сообщений.
tr: İletiler için dinleme işlemi başladıktan sonra bu işleme izin verilmez.

# InvalidBeforeListenHasStarted
source: This operation is not allowed before listening for messages has started.
cs: Před zahájením naslouchání zprávám není tato operace povolená.
de: Dieser Vorgang ist unzulässig, bevor das Lauschen auf Nachrichten gestartet wurde.
ko: 메시지 수신이 시작되기 전에는 이 작업이 허용되지 않습니다.
ru: Эта операция не разрешена до начала ожидания сообщений.
tr: İletiler için dinleme işlemi başlamadan önce bu işleme izin verilmez.

# ParameterNotObject
source: Parameter is not in the form of a single object
cs: Parametr není ve formě jednoho objektu
de: Der Parameter liegt nicht im Format eines einzelnen Objekts vor.
ko: 매개 변수가 단일 개체 형식이 아닙니다.
ru: Параметр не имеет форму одиночного объекта
tr: Parametre, tek nesne biçiminde değil

# ConflictingMethodNameAttribute
source: All overloads and overrides of the '{0}' method must share a common value for {1}.{2}.
cs: Všechna přetížení a přepisy metody {0} musí mít společnou hodnotu pro {1}.{2}.
de: Alle Überladungen und Überschreibungen der Methode "{0}" müssen einen gemeinsamen Wert für {1} aufweisen.{2}.
ko: '{0}' 메서드의 모든 오버로드 및 재정의는 {1}에 대한 공통 값을 공유해야 합니다.{2}.
ru: Все перегрузки и переопределения метода "{0}" должны использовать общее значение {1}.{2}.
tr: '{0}' metodunun tüm aşırı yükleme ve geçersiz kılmaları {1} için ortak bir değere sahip olmalıdır.{2}.

# ConflictingMethodAttributeValue
source: .NET methods '{0}' and '{1}' cannot both map to the same request method name: '{2}'.
cs: Metody .NET {0} i {1} se nemůžou současně mapovat ke stejnému názvu metody žádosti: {2}.
de: Die .NET-Methoden "{0}" und "{1}" können nicht beide dem gleichen Anforderungsmethodennamen zugeordnet werden: "{2}".
ko: .NET 메서드 '{0}' 및 '{1}'이(가) 둘 다 동일한 요청 메서드 이름에 매핑될 수 없습니다. '{2}'.
ru: Методы .NET "{0}" и "{1}" не могут одновременно быть сопоставлены с одним и тем же именем метода запроса: "{2}".
tr: '{0}' ve '{1}' .NET metotlarının her ikisi de aynı istek metodu adıyla eşlenemez: '{2}'.

# RpcMethodNameNotFound
source: No method by the name '{0}' is found.
cs: Nenašla se žádná metoda s názvem {0}.
de: Keine Methode mit dem Namen "{0}" gefunden.
ko: 이름이 '{0}'인 메서드를 찾지 못했습니다.
ru: Метод с именем "{0}" не найден.
tr: '{0}' adlı metot bulunamadı.

# ConflictMethodSignatureAlreadyRegistered
source: A method with the same name and equivalent parameters has already been registered.
cs: Metoda se stejným názvem a rovnocennými parametry už je registrovaná.
de: Es wurde bereits eine Methode mit diesem Namen und identischen Parametern registriert.
ko: 동일한 이름 및 동일한 매개 변수가 있는 메서드가 이미 등록되어 있습니다.
ru: Метод с таким именем и аналогичными параметрами уже зарегистрирован.
tr: Aynı ada ve eşdeğer parametrelere sahip bir metot zaten kaydedildi.

# TargetObjectAndMethodStaticFlagMismatch
source: A target object should be supplied if and only if the method is not static.
cs: Cílový objekt by se měl zadat jen a pouze tehdy, pokud metoda není statická.
de: Ein Zielobjekt darf nur angegeben werden, wenn die Methode nicht statisch ist.
ko: 메서드가 정적이지 않은 경우에만 대상 개체를 제공해야 합니다.
ru: Необходимо предоставить целевой объект, только если метод не статичный.
tr: Bir hedef nesne, yalnızca metot statik olmadığında sağlanmalıdır.

# MustBeListening
source: Listening must be started first.
cs: Nejdříve je potřeba spustit naslouchání.
de: Zunächst muss das Lauschen gestartet werden.
ko: 수신이 먼저 시작되어야 합니다.
ru: Сначала нужно запустить прослушивание.
tr: Önce dinleme başlatılmalıdır.

# MustNotBeListening
source: This cannot be done after listening has started.
cs: Tuto akci nejde provést po spuštění naslouchání.
de: Dieser Vorgang kann nicht ausgeführt werden, nachdem das Lauschen gestartet wurde.
ko: 수신이 시작된 후 이 작업은 완료할 수 없습니다.
ru: После запуска прослушивания сделать это невозможно.
tr: Bu işlem dinleme başlatıldıktan sonra gerçekleştirilemez.

# FatalExceptionWasThrown
source: A fatal exception was thrown from the server method {0}: {1}
cs: Při volání metody serveru {0} došlo k závažné výjimce: {1}
de: Eine schwerwiegende Ausnahme wurde von der Servermethode "{0}" ausgelöst: {1}
ko: 서버 메서드에서 치명적인 예외가 throw되었습니다. {0}: {1}
ru: Метод сервера {0} вызвал неустранимое исключение: {1}
tr: {0}: {1} sunucu metodundan önemli bir özel durum oluşturuldu.

# UnsupportedEventHandlerTypeOnClientProxyInterface
source: Unsupported event handler type on "{0}". Only EventHandler and EventHandler<T> are supported.
cs: Nepodporovaný typ obslužné rutiny události v: {0}. Jsou podporovány jen EventHandler a EventHandler<T>.
de: Nicht unterstützter Ereignishandlertyp auf "{0}". Nur EventHandler und EventHandler<T> werden unterstützt.
ko: "{0}"의 지원되지 않는 이벤트 처리기 형식입니다. EventHandler 및 EventHandler<T>만 지원됩니다.
ru: Тип обработчика событий в "{0}" не поддерживается. Поддерживаются только EventHandler и EventHandler<T>.
tr: "{0}" üzerindeki olay işleyici türü desteklenmiyor. Yalnızca EventHandler ve EventHandler<T> desteklenir.

# UnsupportedGenericMethodsOnClientProxyInterface
source: Generic methods are not supported.
cs: Obecné metody nejsou podporovány.
de: Generische Methoden werden nicht unterstützt.
ko: 제네릭 메서드는 지원되지 않습니다.
ru: Универсальные методы не поддерживаются.
tr: Genel metotlar desteklenmiyor.

# UnsupportedMethodReturnTypeOnClientProxyInterface
source: Method "{0}" has unsupported return type "{1}". Only Task-returning methods are supported.
cs: Metoda {0} obsahuje nepodporovaný návratový typ {1}. Jsou podporovány jen metody vracející úlohy.
de: Die Methode "{0}" weist einen nicht unterstützten Rückgabetyp "{1}" auf. Es werden nur Methoden unterstützt, die Tasks zurückgeben.
ko: "{0}" 메서드에 지원되지 않는 "{1}" 반환 형식이 있습니다. 태스크 반환 메서드만 지원됩니다.
ru: Тип возвращаемого значения метода "{0}" ("{1}") не поддерживается. Поддерживаются только методы, возвращающие задачи.
tr: "{0}" metodunun "{1}" dönüş türü desteklenmiyor. Yalnızca Task döndüren metotlar desteklenir.

# UnsupportedPropertiesOnClientProxyInterface
source: Properties are not supported for service interfaces.
cs: Vlastnosti nejsou podporovány u rozhraní služby.
de: Eigenschaften werden für Dienstschnittstellen nicht unterstützt.
ko: 속성은 서비스 인터페이스에 지원되지 않습니다.
ru: Свойства интерфейсов служб не поддерживаются.
tr: Özellikler hizmet arabirimleri için desteklenmiyor.

# ClientProxyTypeArgumentMustBeAnInterface
source: "{0}" is not an interface.
cs: {0} není rozhraní.
de: "{0}" ist keine Schnittstelle.
ko: "{0}"은(는) 인터페이스가 아닙니다.
ru: "{0}" не является интерфейсом.
tr: "{0}" bir arabirim değil.

# TextEncoderNotApplicable
source: Text encoding is not supported because the formatter "{0}" does not implement "{1}".
cs: Kódování textu není podporováno, protože formátovací modul {0} neimplementuje {1}.
de: Die Textcodierung wird nicht unterstützt, weil "{1}" vom Formatierer "{0}" nicht implementiert wird.
ru: Кодировка текста не поддерживается, так как модуль форматирования "{0}" не реализует "{1}".
tr: "{0}" biçimlendiricisi "{1}" türünü uygulamadığından metin kodlaması desteklenmiyor.

# ConnectionDropped
source: The JSON-RPC connection with the remote party was lost before the request could complete.
cs: Připojení JSON-RPC se vzdálenou stranou bylo ztraceno, ještě než se žádost mohla dokončit.
de: Die JSON-RPC-Verbindung mit der Gegenseite ging verloren, bevor die Anforderung abgeschlossen werden konnte.
ru: Соединение JSON-RPC с удаленной стороной было утрачено до того, как удалось выполнить запрос.
tr: Uzak tarafla JSON-RPC bağlantısı istek tamamlanamadan kesildi.

# RequiredArgumentMissing
source: An argument was not supplied for a required parameter.
de: Für einen erforderlichen Parameter wurde ein Arguemt nicht angegeben.
tr: Gerekli bir parametre için bağımsız değişken sağlanmadı.

# CancellationTokenMustBeLastParameter
source: A CancellationToken is only allowed as the last parameter.
de: Ein CancellationToken ist nur als letzter Parameter zulässig.
ru: CancellationToken может указываться только в качестве последнего параметра.
tr: Bir CancellationToken'a yalnızca son parametre olarak izin verilir.

# UnsupportedJsonRpcProtocolVersion
source: Unsupported JSON-RPC protocol version {0}. The supported protocol versions are: {1}
de: Nicht unterstützte JSON-RPC-Protokollversion: {0}. Folgende Protokollversionen werden unterstützt: {1}
tr: Desteklenmeyen JSON-RPC protokolü sürüm {0}. Desteklenen protokol sürümleri: {1}

# ParameterObjectsNotSupportedInJsonRpc10
source: JSON-RPC 1.0 does not support named arguments (parameters passed within an object). Use positional arguments (parameter arrays) or set protocol version to 2.0.
de: JSON-RPC 1.0 unterstützt keine benannten Argumente (innerhalb eines Objekts übergebene Parameter). Verwenden Sie Positionsargumente (Parameterarrays), oder legen Sie die Protokollversion auf 2.0 fest.
tr: JSON-RPC 1.0 adlandırılmış bağımsız değişkenleri (bir nesne içinde geçirilen parametreler) desteklemez. Konumsal bağımsız değişkenler (parametre dizileri) kullanın veya protokolü sürümünü 2.0 olarak belirleyin.
