Repository: osexpert/vs-streamjsonrpc
Catalog: src/StreamJsonRpc/xlf/Resources.*.xlf
Languages: es, fr, it, ja, pl, pt_br, zh_hans, zh_hant

# BothReadableWritableAreNull
source: Both readable and writable are null.
es: La lectura y escritura son NULL.
fr: readable et writable sont tous les deux Null.
it: Readable e Writable sono entrambi Null.
ja: Readable と Writable の両方が null です。
pl: Elementy readable i writable mają wartość null.
pt_br: Legível e gravável são nulos.
zh_hans: 可读内容和可写内容均为 null。
zh_hant: Readable 和 Writable 都是 Null。

# CannotBeCalledAfterGetAsyncEnumerator
source: This cannot be done after GetAsyncEnumerator has already been called.
es: Esta acción no se puede realizar después de haber llamado a GetAsyncEnumerator.
fr: Ceci ne peut pas être effectué après l'appel de GetAsyncEnumerator.
it: Non è possibile eseguire questa operazione dopo che è già stato chiamato GetAsyncEnumerator.
ja: GetAsyncEnumerator が既に呼び出されている場合は、これを行うことはできません。
pl: Nie można tego zrobić po wykonaniu operacji GetAsyncEnumerator.
pt_br: Isso não pode ser feito depois que GetAsyncEnumerator é chamado.

# DroppingRequestDueToNoTargetObject
source: Got a request to execute '{0}' but have no callback object. Dropping the request.
es: Recibió una solicitud para ejecutar '{0}', pero no hay ningún objeto de devolución de llamada. Anulando la solicitud.
fr: A reçu une demande pour exécuter '{0}' mais n’a aucun objet de rappel. Suppression de la demande.
it: È stata ricevuta una richiesta per l'esecuzione di '{0}' ma non sono presenti oggetti di callback. La richiesta verrà eliminata.
ja: '{0}' の実行の要求を受け取りましたが、コールバック オブジェクトがありません。要求を削除しています。
pl: Otrzymano żądanie wykonania metody „{0}”, ale brakuje obiektu wywołania zwrotnego. Żądanie zostanie odrzucone.
pt_br: Recebeu uma solicitação para executar '{0}', mas não há nenhum objeto de retorno de chamada. Removendo a solicitação.
zh_hans: 已获得执行“{0}”的请求，但没有回调对象。删除请求。
zh_hant: 取得執行 '{0}' 的要求，但沒有回呼物件。正在卸除要求。

# ElementsAlreadyPrefetched
source: This enumeration has already prefetched elements once.
es: Esta enumeración ya ha capturado previamente los elementos una vez.
fr: Cette énumération a déjà effectué une prérécupération (prefetch) des éléments.
it: Questa enumerazione ha già eseguito la prelettura degli elementi in passato.
ja: この列挙では既に要素が以前にプリフェッチされています。
pl: W tym wyliczeniu wybrano już elementy.
pt_br: Essa enumeração já teve elementos pré-buscados uma vez.

# EnumValueNotRecognized
source: The value {0} is not among the recognized or supported members of the enum type.
es: El valor {0} no se encuentra entre los miembros reconocidos o admitidos del tipo de enumeración.
fr: La valeur {0} ne se trouve pas parmi les membres reconnus ou pris en charge du type enum.
it: Il valore {0} non è compreso tra i membri riconosciuti o supportati del tipo enumerazione.
ja: {0} 値は、列挙型の認識されたメンバーまたはサポートされたメンバーに含まれていません。
pl: Wartość {0} nie należy do rozpoznawanych ani obsługiwanych składowych typu wyliczeniowego.
pt_br: O valor {0} não está entre os membros reconhecidos ou com suporte do tipo enumerado.

# ErrorWritingJsonRpcResult
source: Error writing JSON RPC Result: {0}: {1}
es: Error al escribir el resultado de JSON RPC: {0}: {1}
fr: Erreur lors de l’écriture du résultat de JSON RPC : {0} : {1}
it: Si è verificato un errore durante la scrittura del risultato della RPC JSON. {0}: {1}
ja: JSON RPC 結果の書き込み時のエラー: {0}: {1}
pl: Błąd zapisywania wyniku JSON RPC: {0}: {1}
pt_br: Erro ao gravar o resultado de RPC de JSON: {0}: {1}
zh_hans: 写入 JSON RPC 结果 {0} 时出错：{1}
zh_hant: 寫入 JSON RPC 結果時發生錯誤: {0}: {1}

# FailureDeserializingJsonRpc
source: Failure deserializing incoming JSON RPC '{0}': {1}
es: Error al deserializar '{0}' de JSON RPC entrante: {1}
fr: Échec de la désérialisation du protocole JSON RPC entrant '{0}' : {1}
it: Si è verificato un errore durante la deserializzazione della RPC JSON in arrivo '{0}': {1}
ja: JSON RPC '{0}' の逆シリアル化の失敗: {1}
pl: Błąd deserializacji przychodzącego wywołania JSON RPC „{0}”: {1}
pt_br: Falha ao desserializar o RPC de JSON de entrada '{0}': {1}
zh_hans: 反序列化传入 JSON RPC“{0}”时失败：{1}
zh_hant: 將傳入的 JSON RPC '{0}' 還原序列化失敗: {1}

# FailureDeserializingRpcArgument
source: Deserializing JSON-RPC argument with name "{0}" and position {1} to type "{2}" failed: {3}
es: Error al deserializar el argumento JSON-RPC con el nombre "{0}" y la posición {1} en el tipo "{2}": {3}
fr: La désérialisation de l'argument JSON-RPC avec le nom "{0}" et la position {1} en type "{2}" a échoué : {3}
it: La deserializzazione dell'argomento di JSON-RPC con nome "{0}" e posizione {1} nel tipo "{2}" non è riuscita: {3}
ja: 名前が "{0}"、位置が {1} の JSON-RPC 引数を型 "{2}" に逆シリアル化できませんでした: {3}
pl: Deserializowanie argumentu JSON-RPC o nazwie „{0}” i pozycji {1} do typu „{2}” nie powiodło się: {3}
pt_br: Falha na desserialização do argumento JSON-RPC com o nome "{0}" e a posição {1} para o tipo "{2}": {3}

# FindIProgressOfTError
source: Unable to cast given Type to IProgress<T>
es: No se puede convertir el tipo dado en IProgress<T>
fr: Impossible de caster le type donné en IProgress<T>
it: Non è possibile eseguire il cast del tipo specificato in IProgress<T>
ja: 指定された型は IProgress<T> にキャストできません
pl: Nie można rzutować danego typu na typ IProgress<T>
pt_br: Não é possível converter o Tipo fornecido em IProgress<T>
zh_hans: 无法将给定类型强制转换为 IProgress<T>
zh_hant: 無法將指定的類型轉換為 IProgress<T>

# FormatterConfigurationLockedAfterJsonRpcAssigned
source: The configuration is locked because this formatter has already been associated with a JsonRpc instance.
es: La configuración está bloqueada porque este formateador ya se ha asociado a una instancia de JsonRpc.
fr: La configuration est verrouillée, car ce formateur a déjà été associé à une instance JsonRpc.
it: La configurazione è bloccata perché questo formattatore è già stato associato a un'istanza di JsonRpc.
ja: このフォーマッタは既に JsonRpc インスタンスに関連付けられているため、構成はロックされています。
pl: Konfiguracja jest zablokowana, ponieważ ten program formatujący został już skojarzony z wystąpieniem JsonRpc.
pt_br: A configuração está bloqueada porque este formatador já foi associado a uma instância de JsonRpc.
zh_hans: 配置已锁定，因为此格式化程序已与 JsonRpc 实例关联。
zh_hant: 設定已鎖定，因為這個格式器已經與 JsonRpc 執行個體建立關聯。

# JsonRpcCannotBeNull
source: JSON RPC must not be null.
es: JSON RPC no debe ser NULL.
fr: JSON RPC ne doit pas être Null.
it: La RPC JSON non deve essere Null.
ja: JSON RPC は null にできません。
pl: Wywołanie JSON RPC nie może mieć wartości null.
pt_br: O RPC de JSON não deve ser nulo.
zh_hans: JSON RPC 不得为 null。
zh_hant: JSON RPC 不得為 Null。

# MarshaledObjectInNotificationError
source: This tracked object cannot be included in a notification. Only messages including an "id" property are supported.
es: Este objeto con seguimiento no se puede incluir en una notificación. Solo se admiten los mensajes que incluyen una propiedad "id".
fr: Cet objet suivi ne peut pas être inclus dans une notification. Seuls les messages comportant une propriété "id" sont pris en charge.
it: Questo oggetto tracciato non può essere incluso in una notifica. Sono supportati solo i messaggi che includono una proprietà "id".
ja: この追跡されたオブジェクトを通知に含めることはできません。"id" プロパティを含むメッセージのみがサポートされています。
pl: Tego śledzonego obiektu nie można uwzględnić w powiadomieniu. Obsługiwane są tylko komunikaty zawierające właściwość „id”.
pt_br: Este objeto rastreado não pode ser incluído em uma notificação. Há suporte somente para mensagens que incluem uma propriedade "ID".

# MarshaledObjectInResponseOrNotificationError
source: This tracked object should not be part of any response or notification.
es: Este objeto con seguimiento no debe formar parte de ninguna respuesta o notificación.
fr: Cet objet suivi ne doit pas faire partie d'une réponse ou d'une notification.
it: Questo oggetto rilevato non deve far parte di alcuna risposta o notifica.
ja: 追跡されたこのオブジェクトを応答や通知の一部にすることはできません。
pl: Ten śledzony obiekt nie powinien być częścią żadnej odpowiedzi ani powiadomienia.
pt_br: Esse objeto rastreado não deve fazer parte de nenhuma resposta ou notificação.
zh_hans: 此跟踪对象不应是任何响应或通知的一部分。
zh_hant: 追蹤的這個物件不應為任何回應或通知的一部分。

# MethodHasRefOrOutParameters
source: {0} has ref or out parameter(s), which is not supported
es: {0} tiene los parámetros out o ref no admitidos
fr: {0} a un ou des paramètres ref ou out non pris en charge
it: {0} contiene parametri ref o out e questo comportamento non è supportato
ja: {0} は ref または out パラメーターを含んでいますが、サポートされていません
pl: Metoda {0} ma parametry ref lub out, co nie jest obsługiwane
pt_br: {0} tem os parâmetros ref ou out, que não têm suporte
zh_hans: {0} 具有不受支持的 ref 或 out 参数
zh_hant: {0} 有不支援的 ref 或 out 參數

# MethodParameterCountDoesNotMatch
source: {0} parameter(s) (excluding any CancellationToken): {1}, but the request supplies {2}
es: {0} parámetro(s) (se excluirá cualquier CancellationToken): {1}, pero la solicitud suministra {2}
fr: {0} paramètre(s) (CancellationToken exclu) : {1}, mais la demande fournit {2}
it: I parametri di {0} (escluso eventuali elementi CancellationToken) sono {1}, ma la richiesta ne fornisce {2}
ja: {0} パラメーター (CancellationToken は除外します): {1}、しかし要求は {2} を提供します
pl: Metoda {0} ma liczbę parametrów {1} (nie licząc wszelkich tokenów CancellationToken), ale żądanie dostarcza {2}
pt_br: {0} parâmetro(s) (excluindo qualquer CancellationToken): {1}, mas a solicitação fornece {2}
zh_hans: {0} 参数（排除任何 CancellationToken）：{1}，但请求提供 {2}
zh_hant: {0} 個參數 (排除任何 CancellationToken): {1}，但要求提供 {2}

# MethodParametersNotCompatible
source: {0} parameters are not compatible with the arguments provided in the request.
es: Los parámetros de {0} no son compatibles con los argumentos proporcionados en la solicitud.
fr: Les paramètres de {0} ne sont pas compatibles avec les arguments fournis dans la requête.
it: I parametri di {0} non sono compatibili con gli argomenti specificati nella richiesta.
ja: {0} パラメーターは、要求で指定された引数と互換性がありません。
pl: Parametry {0} nie są zgodne z argumentami zawartymi w żądaniu.
pt_br: Os parâmetros {0} não são compatíveis com os argumentos fornecidos na solicitação.
zh_hans: {0} 参数与请求中提供的参数不兼容。
zh_hant: {0} 參數與在要求中提供的引數不相容。

# NotSupportedWithoutMultiplexingStream
source: Out of band streams/pipes are not supported in this configuration. Have you set a MultiplexingStream on the formatter?
es: No se admiten los flujos o canalizaciones fuera de banda en esta configuración. ¿Ha establecido un elemento MultiplexingStream en el formateador?
fr: Les flux/canaux hors bande ne sont pas pris en charge dans cette configuration. Avez-vous défini un MultiplexingStream sur le formateur ?
it: I flussi e/o le pipe fuori banda non sono supportati in questa configurazione. È stato impostato un elemento MultiplexingStream sul formattatore?
ja: 帯域外のストリームやパイプはこの構成ではサポートされていません。フォーマッタに MultiplexingStream を設定しましたか?
pl: Strumienie/potoki poza pasmem nie są obsługiwane w tej konfiguracji. Czy element MultiplexingStream został ustawiony w programie formatującym?
pt_br: Não há suporte para fluxos ou pipes fora de banda nesta configuração. Você definiu um MultiplexingStream no formatador?
zh_hans: 此配置中不支持带外流/管道。是否在格式化程序上设置了 MultiplexingStream?
zh_hant: 此設定不支援頻外資料流/管道。要在格式器上設定 MultiplexingStream 嗎?

source: Reached end of stream.
es: Se alcanzó el final de la secuencia.
fr: Fin de flux atteinte.
it: È stata raggiunta la fine del flusso.
ja: ストリームの終わりに達しました。
pl: Osiągnięto koniec strumienia.
pt_br: Fim do fluxo alcançado.
zh_hans: 已达到流结尾。
zh_hant: 已到達資料流結尾。

# ReadingJsonRpcStreamFailed
source: Reading JSON RPC from the stream failed with {0}: {1}
es: Error al leer JSON RPC desde la secuencia con {0}: {1}
fr: La lecture de JSON RPC à partir du flux a échoué avec {0} : {1}
it: La lettura della RPC JSON dal flusso non è riuscita. {0}: {1}
ja: ストリームからの JSON RPC の読み取りに {0} で失敗しました: {1}
pl: Odczytywanie wywołania JSON RPC ze strumienia nie powiodło się — {0}: {1}
pt_br: Falha na leitura de RPC de JSON do fluxo com {0}: {1}
zh_hans: 从流读取 JSON RPC 失败，出现 {0}：{1}
zh_hant: 從資料流讀取 JSON RPC 失敗，發生 {0}: {1}

# RelayAlreadySet
source: Relay connection has already been established.
es: Ya se ha establecido la conexión de retransmisión.
fr: La connexion au relais a déjà été établie.
it: La connessione di inoltro è già stata stabilita.
ja: リレー接続は既に確立されています。
pl: Połączenie przekazywania zostało już ustanowione.
pt_br: A conexão de retransmissão já foi estabelecida.
zh_hans: 已建立中继连接。
zh_hant: 已建立轉送連線。

source: Response is not error.
es: La respuesta no es un error.
fr: La réponse n’est pas une erreur.
it: La risposta non è un errore.
ja: 応答は、エラーではありません。
pl: Odpowiedź nie jest błędem.
pt_br: A resposta não é um erro.
zh_hans: 响应不是错误。
zh_hant: 回應不是錯誤。

# ResponseUnexpectedFormat
source: Response is in an unexpected format. Only error and result are supported: {0}
es: La respuesta tiene un formato no esperado. Solo se admiten errores y resultados: {0}
fr: Le format de la réponse est inattendu. Seuls l'erreur et le résultat sont pris en charge : {0}
it: Il formato della risposta è imprevisto. Sono supportati solo l'errore e il risultato: {0}
ja: 応答が予期しない形式です。エラーと結果のみがサポートされています: {0}
pl: Odpowiedź ma nieoczekiwany format. Obsługiwane są tylko błędy i wyniki: {0}
pt_br: A resposta está em um formato inesperado. Há suporte somente para erro e resultado: {0}
zh_hans: 响应为意外格式。仅支持错误和结果: {0}
zh_hant: 回應採用了非預期的格式。只支援錯誤和結果: {0}

# StreamDisposed
source: Stream has been disposed
es: Se ha eliminado la secuencia
fr: Le flux a été supprimé
it: Il flusso è stato eliminato
ja: ストリームが破棄されました
pl: Strumień został usunięty
pt_br: O fluxo foi descartado
zh_hans: 已释放流
zh_hant: 資料流已處置

# TaskNotCompleted
source: The task is not completed.
es: La tarea no está completada.
fr: La tâche n’est pas effectuée.
it: L'attività non è stata completata.
ja: タスクが完了していません。
pl: Zadanie nie zostało ukończone.
pt_br: A tarefa não foi concluída.
zh_hans: 任务未完成。
zh_hant: 此工作未完成。

# TaskWasCancelled
source: The task was cancelled.
es: La tarea se canceló.
fr: La tâche a été annulée.
it: L'attività è stata annullata.
ja: タスクはキャンセルされました。
pl: Zadanie zostało anulowane.
pt_br: A tarefa foi cancelada.
zh_hans: 任务已取消。
zh_hant: 工作已取消。

# UnableToFindMethod
source: Unable to find method '{0}/{1}' on {2} for the following reasons: {3}
es: No se puede encontrar el método '{0}/{1}' en {2} por las siguientes razones: {3}
fr: Impossible de trouver la méthode '{0}/{1}' sur {2} pour les raisons suivantes : {3}
it: Il metodo '{0}/{1}' in {2} non è stato trovato per i motivi seguenti: {3}
ja: 次の理由により、{2} でメソッド '{0}/{1}' が見つかりません: {3}
pl: Nie można odnaleźć metody „{0}/{1}” w klasie {2}. Przyczyny: {3}
pt_br: Não é possível encontrar o método '{0}/{1}' em {2} pelos seguintes motivos: {3}
zh_hans: 找不到 {2} 上的方法“{0}/{1}”，原因如下：{3}
zh_hant: 在 {2} 上找不到方法 '{0}/{1}'，原因如下: {3}

# UnexpectedErrorProcessingJsonRpc
source: Unexpected error processing JSON-RPC message: {0}
es: Mensaje de error inesperado al procesar JSON-RPC: {0}
fr: Erreur inattendue durant le traitement du message JSON-RPC : {0}
it: Errore imprevisto durante l'elaborazione del messaggio JSON-RPC: {0}
ja: JSON-RPC メッセージの処理で予期しないエラーが発生しました: {0}
pl: Nieoczekiwany błąd podczas przetwarzania komunikatu JSON-RPC: {0}
pt_br: Erro inesperado ao processar a mensagem JSON-RPC: {0}
zh_hans: 处理 JSON-RPC 消息时出现意外错误: {0}
zh_hant: 處理 JSON-RPC 訊息時發生未預期的錯誤: {0}

# UnexpectedResponseWithNoMatchingRequest
source: A response was received without a request having been sent.
es: Se recibió una respuesta sin enviar una solicitud.
it: È stata ricevuta una risposta ma non è stata inviata alcuna richiesta.
ja: 応答を受信しましたが、要求は送信されていません。
pl: Odebrano odpowiedź bez wysłania żądania.
pt_br: Uma resposta foi recebida sem que uma solicitação tenha sido enviada.

# UnknownTokenToMarshaledObject
source: This remote object no longer exists.
es: Este objeto remoto ya no existe.
fr: Cet objet distant n'existe plus.
it: Questo oggetto remoto non esiste più.
ja: このリモート オブジェクトは存在しません。
pl: Ten obiekt zdalny już nie istnieje.
pt_br: Este objeto remoto não existe mais.

# UnrecognizableMessage
source: Unable to recognize incoming message as one the JSON-RPC 2.0 defined message types.
es: No se puede reconocer el mensaje entrante como uno de los tipos de mensaje de JSON-RPC 2.0 definidos.
fr: Impossible de reconnaître le message entrant comme l'un des types de message JSON-RPC 2.0 définis.
it: Non è possibile riconoscere il messaggio in arrivo come uno dei tipi di messaggio definiti nella specifica JSON-RPC 2.0.
ja: 受信メッセージを JSON-RPC 2.0 定義メッセージの種類として認識できません。
pl: Nie można rozpoznać komunikatu przychodzącego jako jednego z typów komunikatów zdefiniowanych w specyfikacji JSON-RPC 2.0.
pt_br: Não é possível reconhecer a mensagem de entrada como um dos tipos de mensagem definidos do JSON-RPC 2.0.
zh_hans: 无法将传入消息识别为 JSON-RPC 2.0 定义的消息类型。
zh_hant: 無法將內送郵件辨識為其中一種 JSON-RPC 2.0 定義的訊息類型。

# UnrecognizedIncomingJsonRpc
source: Incoming JSON-RPC message did not conform to a recognized pattern.
es: El mensaje de JSON-RPC entrante no se ajusta a un patrón reconocido.
fr: Le message JSON-RPC entrant n’est pas conforme à un modèle reconnu.
it: Il messaggio JSON-RPC in arrivo non è conforme a un modello riconosciuto.
ja: JSON-RPC 受信メッセージは、認識されるパターンに準拠していません。
pl: Przychodzący komunikat JSON-RPC nie był zgodny z rozpoznanym wzorcem.
pt_br: A mensagem JSON-RPC de entrada não estava em conformidade com um padrão reconhecido.
zh_hans: 传入的 JSON-RPC 消息不符合已识别的模式。
zh_hant: 內送 JSON-RPC 訊息不符合已識別的模式。

# HeaderContentLengthNotParseable
source: Failed parsing Content-Length header into a positive integer.
es: No se pudo analizar el encabezado Content-Length en un número entero positivo.
fr: Échec de l’analyse de l’en-tête Content-Length dans un entier positif.
it: Non è stato possibile analizzare l'intestazione di Content-Length in un numero intero positivo.
ja: Content-Length ヘッダーを正の整数に解析できませんでした。
pl: Nie powiodło się przekształcanie nagłówka Content-Length w dodatnią liczbę całkowitą.
pt_br: Falha ao analisar o cabeçalho de Content-Length em um inteiro positivo.
zh_hans: 无法将 Content-Length 标头分析为一个正整数。
zh_hant: 無法將 Content-Length 標頭解析為正整數。

# HeaderValueTooLarge
source: The size of the message header exceeds the maximum supported size.
es: El tamaño del encabezado del mensaje supera el tamaño máximo admitido.
fr: La taille de l’en-tête du message dépasse la taille maximale prise en charge.
it: Le dimensioni dell'intestazione del messaggio superano quelle massime supportate.
ja: メッセージ ヘッダーのサイズは、サポートされる最大サイズを超えています。
pl: Rozmiar nagłówka komunikatu przekracza maksymalny obsługiwany rozmiar.
pt_br: O tamanho do cabeçalho da mensagem excede o tamanho máximo com suporte.
zh_hans: 邮件标头的大小超出了支持的最大大小。
zh_hant: 訊息標頭的大小超過支援的大小上限。

# UnexpectedTokenReadingHeader
source: Unexpected token '{0}' while parsing header.
es: Token inesperado (token) '{0}' al analizar el encabezado.
fr: Jeton inattendu '{0}' lors de l’analyse d’en-tête.
it: Token '{0}' imprevisto durante l'analisi dell'intestazione.
ja: ヘッダーを解析中の予期しないトークン '{0}'。
pl: Nieoczekiwany token „{0}” podczas analizowania nagłówka.
pt_br: Token inesperado '{0}' durante a análise de cabeçalho.
zh_hans: 分析标头时出现意外标记“{0}”。
zh_hant: 分析標頭時發生未預期的語彙基元 "{0}"。

# PositiveIntegerRequired
source: A positive integer is required.
es: Se requiere un número entero positivo.
fr: Un nombre entier positif est obligatoire.
it: È richiesto un numero intero positivo.
ja: 正の整数が必要です。
pl: Wymagana jest dodatnia liczba całkowita.
pt_br: Um inteiro positivo é necessário.
zh_hans: 必须提供一个正整数。
zh_hant: 需要正整數。

# FillBufferFirst
source: The buffer is empty. Call the async method to fill it first.
es: El búfer está vacío. Llame primero al método asincrónico para llenarlo.
fr: Le tampon est vide. Appelez la méthode async pour commencer par le remplir.
it: Il buffer è vuoto. Chiamare il metodo asincrono per compilarlo prima.
ja: バッファーが空です。まずそれを埋めるための非同期メソッドを呼び出します。
pl: Bufor jest pusty. Wywołaj metodę asynchroniczną, aby najpierw go wypełnić.
pt_br: O buffer está vazio. Chame o método de async para preenchê-lo primeiro.
zh_hans: 缓冲区为空。请先调用异步方法进行填充。
zh_hant: 緩衝區是空的。請先呼叫非同步方法加以填滿。

# NonNegativeIntegerRequired
source: A non-negative integer is required.
es: Se requiere un número entero no negativo.
fr: Un entier non négatif est obligatoire.
it: È richiesto un numero intero non negativo.
ja: 負でない整数が必要です。
pl: Wymagana jest nieujemna liczba całkowita.
pt_br: Um inteiro não negativo é necessário.
zh_hans: 必须提供一个非负整数。
zh_hant: 需要非負整數。

# SumOfTwoParametersExceedsArrayLength
source: The {0} and {1} parameters exceed length of array.
es: Los parámetros {0} y {1} superan la longitud de la matriz.
fr: Les paramètres {0} et {1} dépassent la longueur du tableau.
it: I parametri {0} e {1} superano la lunghezza della matrice.
ja: {0} と {1} パラメーターが配列の長さを超えました。
pl: Parametry {0} i {1} przekraczają długość tablicy.
pt_br: Os parâmetros {0} e {1} excedem o comprimento da matriz.
zh_hans: {0} 和 {1} 参数超出了数组的长度。
zh_hant: {0} 和 {1} 參數超過陣列的長度。

# StreamMustBeReadable
source: The stream must be readable.
es: La secuencia debe poderse leer.
fr: Le flux doit être lisible.
it: Il flusso deve essere leggibile.
ja: ストリームは読み取り可能である必要があります。
pl: Strumień musi być możliwy do odczytu.
pt_br: O fluxo deve ser legível.
zh_hans: 流必须可读。
zh_hant: 資料流必須可讀取。

# StreamMustBeWriteable
source: The stream must be writeable.
es: La secuencia debe poderse escribir.
fr: Le flux doit être accessible en écriture.
it: Il flusso deve essere scrivibile.
ja: ストリームは書き込み可能である必要があります。
pl: Strumień musi być możliwy do zapisu.
pt_br: O fluxo deve ser gravável.
zh_hans: 流必须可写。
zh_hant: 資料流必須可寫入。

# InvalidAfterListenHasStarted
source: This operation is not allowed after listening for messages has started.
es: Esta operación no se permite después de que se haya iniciado la escucha de mensajes.
fr: Cette opération n’est pas autorisée une fois que l’écoute des messages a commencé.
it: Questa operazione non è consentita dopo l'avvio dell'ascolto dei messaggi.
ja: メッセージの聞き取りの開始後に、この操作は許可されていません。
pl: Ta operacja jest niedozwolona po rozpoczęciu nasłuchiwania komunikatów.
pt_br: Essa operação não é permitida após a escuta de mensagens começar.
zh_hans: 启动消息侦听后不允许此操作。
zh_hant: 開始接聽訊息後不允許此作業。

# InvalidBeforeListenHasStarted
source: This operation is not allowed before listening for messages has started.
es: Esta operación no se permite antes de que se haya iniciado la escucha de mensajes.
fr: Cette opération n’est pas autorisée avant que l’écoute des messages ait commencé.
it: Questa operazione non è consentita prima dell'avvio dell'ascolto dei messaggi.
ja: メッセージの聞き取りの開始前に、この操作は許可されていません。
pl: Ta operacja jest niedozwolona przed rozpoczęciem nasłuchiwania komunikatów.
pt_br: Essa operação não é permitida antes da escuta de mensagens começar.
zh_hans: 启动消息侦听前不允许此操作。
zh_hant: 開始接聽訊息前不允許此作業。

# ParameterNotObject
source: Parameter is not in the form of a single object
es: El parámetro no tiene la forma de un único objeto
fr: Le paramètre n'est pas sous la forme d'un seul objet
it: Il parametro non è disponibile sotto forma di singolo oggetto
ja: パラメーターが単一のオブジェクトの形式ではありません
pl: Parametr nie ma postaci pojedynczego obiektu
pt_br: O parâmetro não está no formato de um objeto único
zh_hans: 参数不是单对象的形式
zh_hant: 參數不是單一物件的格式

# ConflictingMethodNameAttribute
source: All overloads and overrides of the '{0}' method must share a common value for {1}.{2}.
es: Todas las sobrecargas e invalidaciones del método "{0}" deben compartir un valor común para {1}.{2}.
fr: Toutes les surcharges et les substitutions de la méthode '{0}' doivent partager une valeur commune pour {1}.{2}.
it: Tutti gli overload e gli override del metodo '{0}' devono condividere un valore comune per {1}.{2}.
ja: '{0}' メソッドのすべてのオーバーロードと上書きは、{1}.{2} の共通の値を共有する必要があります。
pl: Wszystkie przeciążenia i przesłonięcia metody „{0}” muszą udostępniać wspólną wartość dla elementu {1}.{2}.
pt_br: Todas as sobrecargas e substituições do método '{0}' devem compartilhar um valor comum para {1}.{2}.
zh_hans: “{0}”方法的所有重载和重写必须共享 {1}.{2} 的常见值。
zh_hant: '{0}' 方法之所有多載與覆寫的 {1}.{2} 必須共用同一個通用值。
