Repository: osexpert/vs-streamjsonrpc
Catalog: src/StreamJsonRpc/xlf/Resources.*.xlf
Languages: es, fr, it, ja, pl, pt_br, zh_hans, zh_hant

# ConflictingMethodAttributeValue
source: .NET methods '{0}' and '{1}' cannot both map to the same request method name: '{2}'.
es: Los métodos .NET "{0}" y "{1}" no pueden asignar ambos el mismo nombre de método de solicitud: "{2}".
fr: Les méthodes .NET '{0}' et '{1}' ne peuvent pas mapper au même nom de méthode de demande : '{2}'.
it: Non è possibile eseguire il mapping dei metodi .NET '{0}' e '{1}' allo stesso nome di metodo di richiesta: '{2}'.
ja: .NET メソッド '{0}' と '{1}' を両方とも同じ要求メソッド名 '{2}' にマッピングすることはできません。
pl: Metody programu .NET „{0}” i „{1}” nie mogą mieć jednocześnie mapowania na tę samą nazwę metody żądania: „{2}”.
pt_br: Os métodos .NET '{0}' e '{1}' não podem ser mapeados para o mesmo nome do método de solicitação: '{2}'.
zh_hans: .NET 方法“{0}”和“{1}”不能映射到同一请求方法名“{2}”。
zh_hant: .NET 方法 '{0}' 與 '{1}' 不得同時對應到同一個要求方法名稱: '{2}'。

# RpcMethodNameNotFound
source: No method by the name '{0}' is found.
es: No se encontró ningún método con el nombre "{0}".
fr: La méthode nommée '{0}' est introuvable.
it: Non è stato trovato alcun metodo denominato '{0}'.
ja: 名前 '{0}' によるメソッドは見つかりませんでした。
pl: Nie znaleziono metody o nazwie „{0}”.
pt_br: Nenhum método com o nome '{0}' foi encontrado.
zh_hans: 找不到名为“{0}”的方法。
zh_hant: 找不到名稱為 '{0}' 的方法。

# ConflictMethodSignatureAlreadyRegistered
source: A method with the same name and equivalent parameters has already been registered.
es: Ya se ha registrado un método con el mismo nombre y parámetros equivalentes.
fr: Une méthode ayant le même nom et des paramètres équivalents a déjà été inscrite.
it: È già stato registrato un metodo con lo stesso nome e parametri equivalenti.
ja: 同じ名前を持つメソッドと同等のパラメーターは既に登録されています。
pl: Metoda o tej samej nazwie i odpowiadających jej parametrach została już zarejestrowana.
pt_br: Um método com o mesmo nome e parâmetros equivalentes já foi registrado.
zh_hans: 已注册了具有相同名称和等效参数的方法。
zh_hant: 具有相同名稱和對等參數的方法已經註冊。

# TargetObjectAndMethodStaticFlagMismatch
source: A target object should be supplied if and only if the method is not static.
es: Se debe proporcionar un objeto de destino si, y solo si, el método no es estático.
fr: Un objet cible doit être fourni si et seulement si la méthode n'est pas statique.
it: È necessario specificare un oggetto di destinazione solo se il metodo non è static.
ja: メソッドが静的でない場合のみ、ターゲット オブジェクトを指定する必要があります。
pl: Należy podać obiekt docelowy tylko wtedy, gdy metoda nie jest statyczna.
pt_br: Um objeto de destino deve ser fornecido se e somente se o método não é estático.
zh_hans: 当且仅当方法不是静态时，才提供目标对象。
zh_hant: 在方法不是靜態的情況下，應提供目標物件，而且只應在這種情況下提供。

# MustBeListening
source: Listening must be started first.
es: Primero debe iniciarse la escucha.
fr: L'écoute doit d'abord démarrer.
it: È necessario avviare prima l'ascolto.
ja: 最初にリッスンを開始する必要があります。
pl: Najpierw należy uruchomić nasłuchiwanie.
pt_br: A escuta precisa ser iniciada primeiro.
zh_hans: 必须先开始侦听。
zh_hant: 必須先開始接聽。

# MustNotBeListening
source: This cannot be done after listening has started.
es: Esto no se puede hacer una vez que haya iniciado la escucha.
fr: Cette opération ne peut pas être effectuée après le démarrage de l'écoute.
it: Non è possibile eseguire questa operazione dopo l'avvio dell'ascolto.
ja: リッスンを開始した後でこれを行うことはできません。
pl: Tego nie można zrobić po uruchomieniu nasłuchiwania.
pt_br: Isso não pode ser feito após o início da escuta.
zh_hans: 侦听开始后，无法完成此操作。
zh_hant: 開始接聽後，才能完成此作業。

# FatalExceptionWasThrown
source: A fatal exception was thrown from the server method {0}: {1}
es: Se lanzó una excepción fatal desde el método del servidor {0}: {1}
fr: Une exception irrécupérable a été levée depuis la méthode de serveur {0} : {1}
it: Il metodo del server {0} ha generato un'eccezione irreversibile: {1}
ja: 致命的な例外がサーバー メソッド {0} からスローされました: {1}
pl: Metoda serwera {0}: {1} zgłosiła wyjątek krytyczny
pt_br: Uma exceção fatal foi gerada pelo método do servidor {0}: {1}
zh_hans: 服务器方法 {0} 引发了严重的异常: {1}
zh_hant: 伺服器方法 {0} 擲出了嚴重例外狀況: {1}

# UnsupportedEventHandlerTypeOnClientProxyInterface
source: Unsupported event handler type on "{0}". Only EventHandler and EventHandler<T> are supported.
es: Tipo de controlador de eventos no admitido en "{0}". Solo se admiten EventHandler o EventHandler<T>.
fr: Type de gestionnaire d'événements non pris en charge sur "{0}". Seuls EventHandler et EventHandler<T> sont pris en charge.
it: Tipo di gestore dell'evento non supportato in "{0}". Sono supportati solo EventHandler e EventHandler<T>.
ja: "{0}" にサポートされていないイベント ハンドラーの型があります。サポートされているのは、EventHandler と EventHandler<T> のみです。
pl: Nieobsługiwany typ procedury obsługi zdarzeń dla elementu „{0}”. Obsługiwane są wyłącznie procedury obsługi EventHandler i EventHandler<T>.
pt_br: Tipo de manipulador de eventos sem suporte no "{0}". Há suporte somente para EventHandler e EventHandler<T>.
zh_hans: “{0}”上不受支持的事件处理程序类型。只支持 EventHandler 和 EventHandler<T>。
zh_hant: 不支援 "{0}" 上的事件處理常式類型。只支援 EventHandler 與 EventHandler<T>。

# UnsupportedGenericMethodsOnClientProxyInterface
source: Generic methods are not supported.
es: Los métodos genéricos no son compatibles.
fr: Les méthodes génériques ne sont pas prises en charge.
it: I metodi generici non sono supportati.
ja: ジェネリック メソッドはサポートされていません。
pl: Metody ogólne nie są obsługiwane.
pt_br: Métodos genéricos não são compatíveis.
zh_hans: 不支持泛型方法。
zh_hant: 不支援泛型方法。

# UnsupportedMethodReturnTypeOnClientProxyInterface
source: Method "{0}" has unsupported return type "{1}". Only Task-returning methods are supported.
es: El método "{0}" tiene el tipo de devolución no admitido "{1}". Solo se admiten los métodos de devolución de tareas.
fr: La méthode "{0}" a un type de retour non pris en charge "{1}". Seules les méthodes qui retournent des tâches sont prises en charge.
it: Il metodo "{0}" contiene il tipo restituito "{1}" che non è supportato. Sono supportati solo i metodi che restituiscono Task.
ja: メソッド "{0}" にはサポートされていない戻り値の型 "{1}" が含まれています。タスクを返すメソッドのみがサポートされています。
pl: Metoda „{0}” ma nieobsługiwany zwracany typ „{1}”. Obsługiwane są tylko metody zwracające zadania.
pt_br: O método "{0}" tem o tipo de retorno não compatível "{1}". Somente os métodos de retorno de tarefa são compatíveis.
zh_hans: 方法“{0}”具有不支持的返回类型“{1}”。只支持返回任务的方法。
zh_hant: 方法 "{0}" 具有不支援的返回類型 "{1}"。只支援 Task-returning 方法。

# UnsupportedPropertiesOnClientProxyInterface
source: Properties are not supported for service interfaces.
es: No se admiten las propiedades para las interfaces de servicio.
fr: Les propriétés ne sont pas prises en charge pour les interfaces de service.
it: Le proprietà non sono supportate per le interfacce di servizio.
ja: プロパティは、サービス インターフェイスではサポートされていません。
pl: Właściwości nie są obsługiwane dla interfejsów usług.
pt_br: Propriedades não são compatíveis com interfaces de serviço.
zh_hans: 服务接口不支持属性。
zh_hant: 服務介面不支援屬性。

# ClientProxyTypeArgumentMustBeAnInterface
source: "{0}" is not an interface.
es: "{0}" no es una interfaz.
fr: "{0}" n'est pas une interface.
it: "{0}" non è un'interfaccia.
ja: "{0}" はインターフェイスではありません。
pl: Element „{0}” nie jest interfejsem.
pt_br: "{0}" não é uma interface.
zh_hans: “{0}”不是接口。
zh_hant: "{0}" 不是介面。

# TextEncoderNotApplicable
source: Text encoding is not supported because the formatter "{0}" does not implement "{1}".
es: La codificación de texto no es compatible porque el formateador "{0}" no implementa "{1}".
fr: L'encodage de texte n’est pas pris en charge car le formateur « {0} » n'implémente pas « {1} ».
it: La codifica del testo non è supportata perché il formattatore "{0}" non implementa "{1}".
ja: フォーマッタ "{0}" で "{1}" が実装されていないため、テキストのエンコーディングはサポートされていません。
pl: Kodowanie tekstu nie jest obsługiwane, ponieważ program formatujący „{0}” nie implementuje elementu „{1}”.
pt_br: Não há suporte para a codificação de texto, pois o formatador "{0}" não implementa "{1}".
zh_hans: 不支持文本编码，因为格式化程序“{0}”未实现“{1}”。
zh_hant: 因為格式器 "{0}" 不實作 "{1}"，所以不支援文字編碼。

# ConnectionDropped
source: The JSON-RPC connection with the remote party was lost before the request could complete.
es: La conexión de JSON-RPC con la parte remota se perdió antes de que se pudiera completar la solicitud.
fr: La connexion JSON-RPC avec le site distant a été interrompue avant la fin de la requête.
it: La connessione JSON-RPC con la parte remota è andata persa prima del completamento della richiesta.
ja: リモート パーティとの JSON-RPC 接続は、要求が完了する前に失われました。
pl: Połączenie JSON-RPC z podmiotem zdalnym zostało utracone, zanim można było ukończyć żądanie.
pt_br: A conexão JSON-RPC com a parte remota foi perdida antes que a solicitação pudesse ser concluída.
zh_hans: 在请求完成之前, 与远程方的 JSON-RPC 连接已丢失。
zh_hant: 在要求完成之前失去了與遠端的 JSON-RPC 連線。

# RequiredArgumentMissing
source: An argument was not supplied for a required parameter.
es: No se proporcionó un argumento para un parámetro requerido.
fr: Un argument n'a pas été fourni pour un paramètre obligatoire.
it: Non è stato specificato alcun argomento per un parametro obbligatorio.
ja: 必須のパラメーターに対して引数が指定されませんでした。
pl: Nie dostarczono argumentu dla wymaganego parametru.
pt_br: Um argumento não foi fornecido para um parâmetro necessário.
zh_hans: 没有为所需参数提供参数。
zh_hant: 未為必要參數提供引數。

# CancellationTokenMustBeLastParameter
source: A CancellationToken is only allowed as the last parameter.
es: Un CancellationToken solo se permite como último parámetro.
fr: Un jeton d'annulation (CancellationToken) est autorisé seulement comme dernier paramètre.
it: Un oggetto CancellationToken è consentito solo come ultimo parametro.
ja: CancellationToken は、最後のパラメーターとしてのみ許可されます。
pl: Element CancellationToken jest dozwolony tylko jako ostatni parametr.
pt_br: Um Token de Cancelamento é permitido somente como o último parâmetro.
zh_hans: CancellationToken 只能用作最后一个参数。
zh_hant: CancellationToken 只可作為最後一個參數。

# UnsupportedJsonRpcProtocolVersion
source: Unsupported JSON-RPC protocol version {0}. The supported protocol versions are: {1}
es: Versión de protocolo JSON-RPC no admitida {0}. Las versiones de protocolo admitidas son: {1}
fr: Version de protocole JSON-RPC {0} non prise en charge. Les versions de protocole prises en charge sont : {1}
it: La versione del protocollo JSON-RPC {0} non è supportata. Le versioni del protocollo supportate sono: {1}
ja: JSON-RPC プロトコル バージョン {0} はサポートされていません。サポート対象バージョン: {1}
pl: Nieobsługiwana wersja protokołu JSON-RPC: {0}. Obsługiwane wersje protokołu: {1}
pt_br: Versão {0} do protocolo JSON-RPC sem suporte. As versões do protocolo com suporte são: {1}
zh_hans: JSON-RPC 协议版本 {0} 不受支持。支持的协议版本为: {1}
zh_hant: 不支援的 JSON-RPC 通訊協定版本 {0}。支援的通訊協定版本為: {1}

# ParameterObjectsNotSupportedInJsonRpc10
source: JSON-RPC 1.0 does not support named arguments (parameters passed within an object). Use positional arguments (parameter arrays) or set protocol version to 2.0.
es: JSON-RPC 1.0 no admite argumentos con nombre (parámetros pasados dentro de un objeto). Utilice argumentos posicionales (matrices de parámetros) o establezca la versión de protocolo en 2.0.
fr: JSON-RPC 1.0 ne prend pas en charge les arguments nommés (paramètres passés dans un objet). Utilisez des arguments positionnels (tableaux de paramètres) ou définissez la version de protocole sur 2.0.
it: JSON-RPC 1.0 non supporta gli argomenti denominati (parametri passati in un oggetto). Usare argomenti posizionali (matrici di parametri) o impostare la versione del protocollo su 2.0.
ja: JSON-RPC 1.0 は名前付き引数 (オブジェクト内で渡されるパラメーター) をサポートしていません。位置引数 (パラメーター配列) を使用するか、プロトコル バージョンを 2.0 に設定してください。
pl: Protokół JSON-RPC 1.0 nie obsługuje nazwanych argumentów (parametrów przekazywanych w ramach obiektu). Użyj argumentów pozycyjnych (tablic parametrów) lub ustaw wersję protokołu na 2.0.
pt_br: O JSON-RPC 1.0 não é compatível com argumentos nomeados (parâmetros passados dentro de um objeto). Use argumentos posicionais (matrizes de parâmetros) ou defina a versão do protocolo para 2.0.
zh_hans: JSON-RPC 1.0 不支持命名参数(在对象中传递的参数)。请使用位置参数(参数数组)或将协议版本设置为 2.0。
zh_hant: JSON-RPC 1.0 不支援具名引數 (在物件中傳遞的參數)。請使用位置引數 (參數陣列)，或將通訊協定版本設定為 2.0。

# ErrorWritingJsonRpcMessage
source: Error writing JSON RPC Message: {0}: {1}
es: Error al escribir el mensaje de JSON RPC: {0}: {1}
fr: Erreur lors de l'écriture du message RPC JSON : {0} : {1}
it: Si è verificato un errore durante la scrittura del messaggio della RPC JSON. {0}: {1}
ja: JSON RPC メッセージの書き込み時のエラー: {0}: {1}
pl: Błąd zapisywania komunikatu JSON zdalnego wywołania procedury: {0}: {1}
pt_br: Erro ao gravar a Mensagem da RPC do JSON: {0}: {1}
zh_hans: 写入 JSON RPC 消息时出错: {0}: {1}
zh_hant: 寫入 JSON RPC 訊息時發生錯誤: {0}: {1}
